Revit 2027 API
DirectShapeReferenceOptions.GetExternalGeometryId Method
 Retrieves the ExternalGeometryId associated with the reference object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalGeometryId GetExternalGeometryId()
Public Function GetExternalGeometryId As ExternalGeometryId
public:
ExternalGeometryId^ GetExternalGeometryId()
member GetExternalGeometryId : unit -> ExternalGeometryId
Return Value
ExternalGeometryId
Remarks
 If an ExternalGeometryId has not been set, this method returns null.
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace